src/cf/src/Documents/КорректировкаДолга/КорректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаДолга</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДебитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДебет</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредит</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧКредиторскаяЗадолженность</name>
    <attributes>
      <name>ОбъектРасчётов</name>
      <type>
        <types>DefinedType.ОбъектРасчётовОбщий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДебиторскаяЗадолженность</name>
    <attributes>
      <name>ОбъектРасчётов</name>
      <type>
        <types>DefinedType.ОбъектРасчётовОбщий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/КорректировкаДолга/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РассчитатьИтоги(Истина);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЗаполнитьПоДебиторскойЗадолженности(Команда)
	ЗаполнитьПоДебиторскойЗадолженностиНаСервере();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКредиторскойЗадолженности(Команда)
	ЗаполнитьПоКредиторскойЗадолженностиНаСервере();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТЧДебиторскаяЗадолженностьПриИзменении(Элемент)
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТЧДебетРасчётныйДокументПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧДебиторскаяЗадолженность.ТекущиеДанные;
	Если ТипЗнч(ТекСтр.ОбъектРасчётов) = Тип("СправочникСсылка.ДоговорыСКонтрагентами") Тогда Возврат КонецЕсли;
	ТекСтр.Сумма = РаботаСДокументамиВызовСервера.ПолучитьСуммуДокумента(ТекСтр.ОбъектРасчётов);
КонецПроцедуры

&НаКлиенте
Процедура ТЧКредиторскаяЗадолженностьПриИзменении(Элемент)
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТЧКредитРасчётныйДокументПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧКредиторскаяЗадолженность.ТекущиеДанные;
	Если ТипЗнч(ТекСтр.ОбъектРасчётов) = Тип("СправочникСсылка.ДоговорыСКонтрагентами") Тогда Возврат КонецЕсли;
	ТекСтр.Сумма = РаботаСДокументамиВызовСервера.ПолучитьСуммуДокумента(ТекСтр.ОбъектРасчётов);
КонецПроцедуры

#КонецОбласти 

#Область Дополнительно

&НаКлиенте
Процедура РассчитатьИтоги(ТолькоРазницу = Ложь)
	Если Не ТолькоРазницу Тогда
		Объект.СуммаДебет = Объект.ТЧДебиторскаяЗадолженность.Итог("Сумма");
		Объект.СуммаКредит = Объект.ТЧКредиторскаяЗадолженность.Итог("Сумма");
	КонецЕсли;
	СуммаРазница = Объект.СуммаДебет - Объект.СуммаКредит;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоДебиторскойЗадолженностиНаСервере()
	Объект.ТЧДебиторскаяЗадолженность.Очистить();
	ДатаСреза = РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект);
	ТЗ = ПолучитьЗадолженность(ДатаСреза, Объект.Организация, Объект.КонтрагентДебитор, Истина);
	Для Каждого Стр Из ТЗ Цикл
		НС = Объект.ТЧДебиторскаяЗадолженность.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоКредиторскойЗадолженностиНаСервере()
	Объект.ТЧКредиторскаяЗадолженность.Очистить();
	ДатаСреза = РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект);
	ТЗ = ПолучитьЗадолженность(ДатаСреза, Объект.Организация, Объект.КонтрагентКредитор, Ложь);
	Для Каждого Стр Из ТЗ Цикл
		НС = Объект.ТЧКредиторскаяЗадолженность.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗадолженность(ДатаСреза, Организация, Контрагент, Дебиторская = Истина)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |	ВЗ.Сумма КАК Сумма
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		СПокупателями.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |		СПокупателями.СуммаОстаток КАК Сумма
	                      |	ИЗ
	                      |		РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(
	                      |				&ДатаСреза,
	                      |				Организация = &Организация
	                      |					И Контрагент = &Контрагент) КАК СПокупателями где Не &Дебиторская
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		СПоставщиками.ОбъектРасчётов,
	                      |		-СПоставщиками.СуммаОстаток
	                      |	ИЗ
	                      |		РегистрНакопления.ВзаиморасчётыСПоставщиками.Остатки(
	                      |				&ДатаСреза,
	                      |				Организация = &Организация
	                      |					И Контрагент = &Контрагент) КАК СПоставщиками где &Дебиторская
						  //|	
						  //|	ОБЪЕДИНИТЬ ВСЕ
						  //|	
						  //|	ВЫБРАТЬ
						  //|		Прочие.Договор,
						  //|		Прочие.СуммаОстаток
						  //|	ИЗ
						  //|		РегистрНакопления.ВзаиморасчётыСКонтрагентамиПрочие.Остатки(
						  //|				&ДатаСреза,
						  //|				Организация = &Организация
						  //|					И Контрагент = &Контрагент) КАК Прочие
	                      |) КАК ВЗ
						  //|ГДЕ
						  //|	ВЫБОР
						  //|			КОГДА &Дебиторская
						  //|				ТОГДА ВЗ.Сумма < 0
						  //|			ИНАЧЕ ВЗ.Сумма > 0
						  //|		КОНЕЦ
						  |");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Дебиторская", Дебиторская);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

#КонецОбласти
